In [1]:
import numpy as np
import pandas as pandas
from pandas import Series, DataFrame

In [5]:
dframe1 = DataFrame({"k1" : ["X", "X", "Y", "Y", "Z"],
                    "k2" : ["alpha", "beta", "alpha", "beta", "alpha"],
                    "dataset1" : np.random.randn(5),
                    "dataset2" : np.random.randn(5)})
dframe1

  k1     k2  dataset1  dataset2
0  X  alpha  0.569962 -0.970583
1  X   beta  2.466095  0.810413
2  Y  alpha -0.054280 -0.239832
3  Y   beta  0.303202 -1.576611
4  Z  alpha -1.281104  0.022580

In [11]:
# series group by data object
group1 = dframe1["dataset1"].groupby(dframe1["k1"])
group1

In [13]:
group1.mean()

k1
X    1.518029
Y    0.124461
Z   -1.281104
Name: dataset1, dtype: float64

In [17]:
cities = np.array(["NY", "LA", "LA", "NY", "NY"])

month = np.array(["JAN", "FEB", "JAN", "FEB", "JAN"])

In [21]:
dframe1["dataset1"].groupby([cities, month]).mean()

LA  FEB    2.466095
    JAN   -0.054280
NY  FEB    0.303202
    JAN   -0.355571
Name: dataset1, dtype: float64

In [23]:
dframe1

  k1     k2  dataset1  dataset2
0  X  alpha  0.569962 -0.970583
1  X   beta  2.466095  0.810413
2  Y  alpha -0.054280 -0.239832
3  Y   beta  0.303202 -1.576611
4  Z  alpha -1.281104  0.022580

In [31]:
# avg of x vals, y vals, z vals --- group by k1 elements, then avg
dframe1.groupby("k1").mean(numeric_only = True)

    dataset1  dataset2
k1
X   1.518029 -0.080085
Y   0.124461 -0.908221
Z  -1.281104  0.022580

In [33]:
dframe1.groupby(["k1", "k2"]).mean(numeric_only = True)

          dataset1  dataset2
k1 k2
X  alpha  0.569962 -0.970583
   beta   2.466095  0.810413
Y  alpha -0.054280 -0.239832
   beta   0.303202 -1.576611
Z  alpha -1.281104  0.022580

In [37]:
# number of entries in column by 'key'
dframe1.groupby("k1").size()

k1
X    2
Y    2
Z    1
dtype: int64

In [41]:
# iterate over groups
for name, group in dframe1.groupby("k1"):
    print("This is the %s group" %name)
    print(group)
    print("\n")

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.569962 -0.970583
1  X   beta  2.466095  0.810413


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.054280 -0.239832
3  Y   beta  0.303202 -1.576611


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -1.281104   0.02258

In [55]:
dframe1

  k1     k2  dataset1  dataset2
0  X  alpha  0.569962 -0.970583
1  X   beta  2.466095  0.810413
2  Y  alpha -0.054280 -0.239832
3  Y   beta  0.303202 -1.576611
4  Z  alpha -1.281104  0.022580

In [57]:
# iterate group by multiple columns --- for k1, k2, and group do prints
for (k1, k2), group in dframe1.groupby(["k1", "k2"]):
    print("Key 1 = %s Key = 2 %s" %(k1, k2))
    print(group)
    print("\n")

Key 1 = X Key = 2 alpha
  k1     k2  dataset1  dataset2
0  X  alpha  0.569962 -0.970583


Key 1 = X Key = 2 beta
  k1    k2  dataset1  dataset2
1  X  beta  2.466095  0.810413


Key 1 = Y Key = 2 alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  -0.05428 -0.239832


Key 1 = Y Key = 2 beta
  k1    k2  dataset1  dataset2
3  Y  beta  0.303202 -1.576611


Key 1 = Z Key = 2 alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -1.281104   0.02258

In [59]:
# create dict based on group by
group_dict = dict(list(dframe1.groupby("k1")))

In [61]:
group_dict["X"]

  k1     k2  dataset1  dataset2
0  X  alpha  0.569962 -0.970583
1  X   beta  2.466095  0.810413

In [75]:
# makes a dict and divides into different dtypes --- float and str as keys
group_dict_axis1 = dict(list(dframe1.T.groupby(dframe1.dtypes)))
group_dict_axis1

{dtype('float64'):                  0         1         2         3         4
 dataset1  0.569962  2.466095  -0.05428  0.303202 -1.281104
 dataset2 -0.970583  0.810413 -0.239832 -1.576611   0.02258,
 dtype('O'):         0     1      2     3      4
 k1      X     X      Y     Y      Z
 k2  alpha  beta  alpha  beta  alpha}

In [81]:
# group by with columns
# look at dataset2, group by k1, k2
# avg based on group...X and alpha, X and beta, Y and alpha, Y and beta, Z and alpha
dataset_2_group = dframe1.groupby(["k1", "k2"])[["dataset2"]]
dataset_2_group.mean()

          dataset2
k1 k2
X  alpha -0.970583
   beta   0.810413
Y  alpha -0.239832
   beta  -1.576611
Z  alpha  0.022580